Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.1/include/pio/pic32cx1025sg41100.h
#define PIN_PB15N_CCL_IN10                         _UL_(47)    
#define MUX_PB15N_CCL_IN10                         _UL_(13)    
#define PINMUX_PB15N_CCL_IN10                      ((PIN_PB15N_CCL_IN10 << 16) | MUX_PB15N_CCL_IN10)
#define PORT_PB15N_CCL_IN10                        (_UL_(1) << 15)

#define PIN_PC21N_CCL_IN10                         _UL_(85)    
#define MUX_PC21N_CCL_IN10                         _UL_(13)    
#define PINMUX_PC21N_CCL_IN10                      ((PIN_PC21N_CCL_IN10 << 16) | MUX_PC21N_CCL_IN10)
#define PORT_PC21N_CCL_IN10                        (_UL_(1) << 21)

#define PIN_PB10N_CCL_IN11                         _UL_(42)    
#define MUX_PB10N_CCL_IN11                         _UL_(13)    
#define PINMUX_PB10N_CCL_IN11                      ((PIN_PB10N_CCL_IN11 << 16) | MUX_PB10N_CCL_IN11)
#define PORT_PB10N_CCL_IN11                        (_UL_(1) << 10)

#define PIN_PB16N_CCL_IN11                         _UL_(48)    
#define MUX_PB16N_CCL_IN11                         _UL_(13)    
#define PINMUX_PB16N_CCL_IN11                      ((PIN_PB16N_CCL_IN11 << 16) | MUX_PB16N_CCL_IN11)
#define PORT_PB16N_CCL_IN11                        (_UL_(1) << 16)

#define PIN_PA07N_CCL_OUT0                         _UL_(7)     
#define MUX_PA07N_CCL_OUT0                         _UL_(13)    
#define PINMUX_PA07N_CCL_OUT0                      ((PIN_PA07N_CCL_OUT0 << 16) | MUX_PA07N_CCL_OUT0)
#define PORT_PA07N_CCL_OUT0                        (_UL_(1) << 7)

#define PIN_PA19N_CCL_OUT0                         _UL_(19)    
#define MUX_PA19N_CCL_OUT0                         _UL_(13)    
#define PINMUX_PA19N_CCL_OUT0                      ((PIN_PA19N_CCL_OUT0 << 16) | MUX_PA19N_CCL_OUT0)
#define PORT_PA19N_CCL_OUT0                        (_UL_(1) << 19)

#define PIN_PB02N_CCL_OUT0                         _UL_(34)    
#define MUX_PB02N_CCL_OUT0                         _UL_(13)    
#define PINMUX_PB02N_CCL_OUT0                      ((PIN_PB02N_CCL_OUT0 << 16) | MUX_PB02N_CCL_OUT0)
#define PORT_PB02N_CCL_OUT0                        (_UL_(1) << 2)

#define PIN_PB23N_CCL_OUT0                         _UL_(55)    
#define MUX_PB23N_CCL_OUT0                         _UL_(13)    
#define PINMUX_PB23N_CCL_OUT0                      ((PIN_PB23N_CCL_OUT0 << 16) | MUX_PB23N_CCL_OUT0)
#define PORT_PB23N_CCL_OUT0                        (_UL_(1) << 23)

#define PIN_PA11N_CCL_OUT1                         _UL_(11)    
#define MUX_PA11N_CCL_OUT1                         _UL_(13)    
#define PINMUX_PA11N_CCL_OUT1                      ((PIN_PA11N_CCL_OUT1 << 16) | MUX_PA11N_CCL_OUT1)
#define PORT_PA11N_CCL_OUT1                        (_UL_(1) << 11)

#define PIN_PA31N_CCL_OUT1                         _UL_(31)    
#define MUX_PA31N_CCL_OUT1                         _UL_(13)    
#define PINMUX_PA31N_CCL_OUT1                      ((PIN_PA31N_CCL_OUT1 << 16) | MUX_PA31N_CCL_OUT1)
#define PORT_PA31N_CCL_OUT1                        (_UL_(1) << 31)

#define PIN_PB11N_CCL_OUT1                         _UL_(43)    
#define MUX_PB11N_CCL_OUT1                         _UL_(13)    
#define PINMUX_PB11N_CCL_OUT1                      ((PIN_PB11N_CCL_OUT1 << 16) | MUX_PB11N_CCL_OUT1)
#define PORT_PB11N_CCL_OUT1                        (_UL_(1) << 11)

#define PIN_PA25N_CCL_OUT2                         _UL_(25)    
#define MUX_PA25N_CCL_OUT2                         _UL_(13)    
#define PINMUX_PA25N_CCL_OUT2                      ((PIN_PA25N_CCL_OUT2 << 16) | MUX_PA25N_CCL_OUT2)
#define PORT_PA25N_CCL_OUT2                        (_UL_(1) << 25)

#define PIN_PB09N_CCL_OUT2                         _UL_(41)    
#define MUX_PB09N_CCL_OUT2                         _UL_(13)    
#define PINMUX_PB09N_CCL_OUT2                      ((PIN_PB09N_CCL_OUT2 << 16) | MUX_PB09N_CCL_OUT2)
#define PORT_PB09N_CCL_OUT2                        (_UL_(1) << 9)

#define PIN_PB17N_CCL_OUT3                         _UL_(49)    
#define MUX_PB17N_CCL_OUT3                         _UL_(13)    
#define PINMUX_PB17N_CCL_OUT3                      ((PIN_PB17N_CCL_OUT3 << 16) | MUX_PB17N_CCL_OUT3)
#define PORT_PB17N_CCL_OUT3                        (_UL_(1) << 17)

/* ========== PORT definition for DAC peripheral ========== */
#define PIN_PA02B_DAC_VOUT0                        _UL_(2)     
#define MUX_PA02B_DAC_VOUT0                        _UL_(1)     
#define PINMUX_PA02B_DAC_VOUT0                     ((PIN_PA02B_DAC_VOUT0 << 16) | MUX_PA02B_DAC_VOUT0)
#define PORT_PA02B_DAC_VOUT0                       (_UL_(1) << 2)

#define PIN_PA05B_DAC_VOUT1                        _UL_(5)     
#define MUX_PA05B_DAC_VOUT1                        _UL_(1)     
#define PINMUX_PA05B_DAC_VOUT1                     ((PIN_PA05B_DAC_VOUT1 << 16) | MUX_PA05B_DAC_VOUT1)
#define PORT_PA05B_DAC_VOUT1                       (_UL_(1) << 5)

/* ========== PORT definition for EIC peripheral ========== */
#define PIN_PA00A_EIC_EXTINT0                      _UL_(0)     
#define MUX_PA00A_EIC_EXTINT0                      _UL_(0)     
#define PINMUX_PA00A_EIC_EXTINT0                   ((PIN_PA00A_EIC_EXTINT0 << 16) | MUX_PA00A_EIC_EXTINT0)
#define PORT_PA00A_EIC_EXTINT0                     (_UL_(1) << 0)
#define PIN_PA00A_EIC_EXTINT_NUM                   _L_(0)       /**< EIC signal: PIN_PA00 External Interrupt Line */

#define PIN_PA16A_EIC_EXTINT0                      _UL_(16)    
#define MUX_PA16A_EIC_EXTINT0                      _UL_(0)     
#define PINMUX_PA16A_EIC_EXTINT0                   ((PIN_PA16A_EIC_EXTINT0 << 16) | MUX_PA16A_EIC_EXTINT0)
#define PORT_PA16A_EIC_EXTINT0                     (_UL_(1) << 16)
#define PIN_PA16A_EIC_EXTINT_NUM                   _L_(0)       /**< EIC signal: PIN_PA16 External Interrupt Line */

#define PIN_PB00A_EIC_EXTINT0                      _UL_(32)    
#define MUX_PB00A_EIC_EXTINT0                      _UL_(0)     
#define PINMUX_PB00A_EIC_EXTINT0                   ((PIN_PB00A_EIC_EXTINT0 << 16) | MUX_PB00A_EIC_EXTINT0)
#define PORT_PB00A_EIC_EXTINT0                     (_UL_(1) << 0)
#define PIN_PB00A_EIC_EXTINT_NUM                   _L_(0)       /**< EIC signal: PIN_PB00 External Interrupt Line */

#define PIN_PB16A_EIC_EXTINT0                      _UL_(48)    
#define MUX_PB16A_EIC_EXTINT0                      _UL_(0)     
#define PINMUX_PB16A_EIC_EXTINT0                   ((PIN_PB16A_EIC_EXTINT0 << 16) | MUX_PB16A_EIC_EXTINT0)
#define PORT_PB16A_EIC_EXTINT0                     (_UL_(1) << 16)
#define PIN_PB16A_EIC_EXTINT_NUM                   _L_(0)       /**< EIC signal: PIN_PB16 External Interrupt Line */

