Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.1/include/pio/pic32cx1025sg41100.h
#define PIN_PA18L_GMAC_GTX0                        _UL_(18)    
#define MUX_PA18L_GMAC_GTX0                        _UL_(11)    
#define PINMUX_PA18L_GMAC_GTX0                     ((PIN_PA18L_GMAC_GTX0 << 16) | MUX_PA18L_GMAC_GTX0)
#define PORT_PA18L_GMAC_GTX0                       (_UL_(1) << 18)

#define PIN_PA19L_GMAC_GTX1                        _UL_(19)    
#define MUX_PA19L_GMAC_GTX1                        _UL_(11)    
#define PINMUX_PA19L_GMAC_GTX1                     ((PIN_PA19L_GMAC_GTX1 << 16) | MUX_PA19L_GMAC_GTX1)
#define PORT_PA19L_GMAC_GTX1                       (_UL_(1) << 19)

#define PIN_PC16L_GMAC_GTX2                        _UL_(80)    
#define MUX_PC16L_GMAC_GTX2                        _UL_(11)    
#define PINMUX_PC16L_GMAC_GTX2                     ((PIN_PC16L_GMAC_GTX2 << 16) | MUX_PC16L_GMAC_GTX2)
#define PORT_PC16L_GMAC_GTX2                       (_UL_(1) << 16)

#define PIN_PC17L_GMAC_GTX3                        _UL_(81)    
#define MUX_PC17L_GMAC_GTX3                        _UL_(11)    
#define PINMUX_PC17L_GMAC_GTX3                     ((PIN_PC17L_GMAC_GTX3 << 16) | MUX_PC17L_GMAC_GTX3)
#define PORT_PC17L_GMAC_GTX3                       (_UL_(1) << 17)

#define PIN_PA14L_GMAC_GTXCK                       _UL_(14)    
#define MUX_PA14L_GMAC_GTXCK                       _UL_(11)    
#define PINMUX_PA14L_GMAC_GTXCK                    ((PIN_PA14L_GMAC_GTXCK << 16) | MUX_PA14L_GMAC_GTXCK)
#define PORT_PA14L_GMAC_GTXCK                      (_UL_(1) << 14)

#define PIN_PA17L_GMAC_GTXEN                       _UL_(17)    
#define MUX_PA17L_GMAC_GTXEN                       _UL_(11)    
#define PINMUX_PA17L_GMAC_GTXEN                    ((PIN_PA17L_GMAC_GTXEN << 16) | MUX_PA17L_GMAC_GTXEN)
#define PORT_PA17L_GMAC_GTXEN                      (_UL_(1) << 17)

#define PIN_PC19L_GMAC_GTXER                       _UL_(83)    
#define MUX_PC19L_GMAC_GTXER                       _UL_(11)    
#define PINMUX_PC19L_GMAC_GTXER                    ((PIN_PC19L_GMAC_GTXER << 16) | MUX_PC19L_GMAC_GTXER)
#define PORT_PC19L_GMAC_GTXER                      (_UL_(1) << 19)

/* ========== PORT definition for I2S peripheral ========== */
#define PIN_PA09J_I2S_FS0                          _UL_(9)     
#define MUX_PA09J_I2S_FS0                          _UL_(9)     
#define PINMUX_PA09J_I2S_FS0                       ((PIN_PA09J_I2S_FS0 << 16) | MUX_PA09J_I2S_FS0)
#define PORT_PA09J_I2S_FS0                         (_UL_(1) << 9)

#define PIN_PA20J_I2S_FS0                          _UL_(20)    
#define MUX_PA20J_I2S_FS0                          _UL_(9)     
#define PINMUX_PA20J_I2S_FS0                       ((PIN_PA20J_I2S_FS0 << 16) | MUX_PA20J_I2S_FS0)
#define PORT_PA20J_I2S_FS0                         (_UL_(1) << 20)

#define PIN_PA23J_I2S_FS1                          _UL_(23)    
#define MUX_PA23J_I2S_FS1                          _UL_(9)     
#define PINMUX_PA23J_I2S_FS1                       ((PIN_PA23J_I2S_FS1 << 16) | MUX_PA23J_I2S_FS1)
#define PORT_PA23J_I2S_FS1                         (_UL_(1) << 23)

#define PIN_PB11J_I2S_FS1                          _UL_(43)    
#define MUX_PB11J_I2S_FS1                          _UL_(9)     
#define PINMUX_PB11J_I2S_FS1                       ((PIN_PB11J_I2S_FS1 << 16) | MUX_PB11J_I2S_FS1)
#define PORT_PB11J_I2S_FS1                         (_UL_(1) << 11)

#define PIN_PA08J_I2S_MCK0                         _UL_(8)     
#define MUX_PA08J_I2S_MCK0                         _UL_(9)     
#define PINMUX_PA08J_I2S_MCK0                      ((PIN_PA08J_I2S_MCK0 << 16) | MUX_PA08J_I2S_MCK0)
#define PORT_PA08J_I2S_MCK0                        (_UL_(1) << 8)

#define PIN_PB17J_I2S_MCK0                         _UL_(49)    
#define MUX_PB17J_I2S_MCK0                         _UL_(9)     
#define PINMUX_PB17J_I2S_MCK0                      ((PIN_PB17J_I2S_MCK0 << 16) | MUX_PB17J_I2S_MCK0)
#define PORT_PB17J_I2S_MCK0                        (_UL_(1) << 17)

#define PIN_PB13J_I2S_MCK1                         _UL_(45)    
#define MUX_PB13J_I2S_MCK1                         _UL_(9)     
#define PINMUX_PB13J_I2S_MCK1                      ((PIN_PB13J_I2S_MCK1 << 16) | MUX_PB13J_I2S_MCK1)
#define PORT_PB13J_I2S_MCK1                        (_UL_(1) << 13)

#define PIN_PA10J_I2S_SCK0                         _UL_(10)    
#define MUX_PA10J_I2S_SCK0                         _UL_(9)     
#define PINMUX_PA10J_I2S_SCK0                      ((PIN_PA10J_I2S_SCK0 << 16) | MUX_PA10J_I2S_SCK0)
#define PORT_PA10J_I2S_SCK0                        (_UL_(1) << 10)

#define PIN_PB16J_I2S_SCK0                         _UL_(48)    
#define MUX_PB16J_I2S_SCK0                         _UL_(9)     
#define PINMUX_PB16J_I2S_SCK0                      ((PIN_PB16J_I2S_SCK0 << 16) | MUX_PB16J_I2S_SCK0)
#define PORT_PB16J_I2S_SCK0                        (_UL_(1) << 16)

#define PIN_PB12J_I2S_SCK1                         _UL_(44)    
#define MUX_PB12J_I2S_SCK1                         _UL_(9)     
#define PINMUX_PB12J_I2S_SCK1                      ((PIN_PB12J_I2S_SCK1 << 16) | MUX_PB12J_I2S_SCK1)
#define PORT_PB12J_I2S_SCK1                        (_UL_(1) << 12)

#define PIN_PA22J_I2S_SDI                          _UL_(22)    
#define MUX_PA22J_I2S_SDI                          _UL_(9)     
#define PINMUX_PA22J_I2S_SDI                       ((PIN_PA22J_I2S_SDI << 16) | MUX_PA22J_I2S_SDI)
#define PORT_PA22J_I2S_SDI                         (_UL_(1) << 22)

#define PIN_PB10J_I2S_SDI                          _UL_(42)    
#define MUX_PB10J_I2S_SDI                          _UL_(9)     
#define PINMUX_PB10J_I2S_SDI                       ((PIN_PB10J_I2S_SDI << 16) | MUX_PB10J_I2S_SDI)
#define PORT_PB10J_I2S_SDI                         (_UL_(1) << 10)

#define PIN_PA11J_I2S_SDO                          _UL_(11)    
#define MUX_PA11J_I2S_SDO                          _UL_(9)     
#define PINMUX_PA11J_I2S_SDO                       ((PIN_PA11J_I2S_SDO << 16) | MUX_PA11J_I2S_SDO)
#define PORT_PA11J_I2S_SDO                         (_UL_(1) << 11)

#define PIN_PA21J_I2S_SDO                          _UL_(21)    
#define MUX_PA21J_I2S_SDO                          _UL_(9)     
#define PINMUX_PA21J_I2S_SDO                       ((PIN_PA21J_I2S_SDO << 16) | MUX_PA21J_I2S_SDO)
#define PORT_PA21J_I2S_SDO                         (_UL_(1) << 21)

/* ========== PORT definition for PCC peripheral ========== */
#define PIN_PA14K_PCC_CLK                          _UL_(14)    
#define MUX_PA14K_PCC_CLK                          _UL_(10)    
#define PINMUX_PA14K_PCC_CLK                       ((PIN_PA14K_PCC_CLK << 16) | MUX_PA14K_PCC_CLK)
#define PORT_PA14K_PCC_CLK                         (_UL_(1) << 14)

#define PIN_PA16K_PCC_DATA0                        _UL_(16)    
#define MUX_PA16K_PCC_DATA0                        _UL_(10)    
#define PINMUX_PA16K_PCC_DATA0                     ((PIN_PA16K_PCC_DATA0 << 16) | MUX_PA16K_PCC_DATA0)
#define PORT_PA16K_PCC_DATA0                       (_UL_(1) << 16)

#define PIN_PA17K_PCC_DATA1                        _UL_(17)    
#define MUX_PA17K_PCC_DATA1                        _UL_(10)    
#define PINMUX_PA17K_PCC_DATA1                     ((PIN_PA17K_PCC_DATA1 << 16) | MUX_PA17K_PCC_DATA1)
#define PORT_PA17K_PCC_DATA1                       (_UL_(1) << 17)

