Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.1/include/pio/pic32cx1025sg41100.h
#define PIN_PA25G_PDEC_QDI1                        _UL_(25)    
#define MUX_PA25G_PDEC_QDI1                        _UL_(6)     
#define PINMUX_PA25G_PDEC_QDI1                     ((PIN_PA25G_PDEC_QDI1 << 16) | MUX_PA25G_PDEC_QDI1)
#define PORT_PA25G_PDEC_QDI1                       (_UL_(1) << 25)

#define PIN_PB20G_PDEC_QDI2                        _UL_(52)    
#define MUX_PB20G_PDEC_QDI2                        _UL_(6)     
#define PINMUX_PB20G_PDEC_QDI2                     ((PIN_PB20G_PDEC_QDI2 << 16) | MUX_PB20G_PDEC_QDI2)
#define PORT_PB20G_PDEC_QDI2                       (_UL_(1) << 20)

#define PIN_PB25G_PDEC_QDI2                        _UL_(57)    
#define MUX_PB25G_PDEC_QDI2                        _UL_(6)     
#define PINMUX_PB25G_PDEC_QDI2                     ((PIN_PB25G_PDEC_QDI2 << 16) | MUX_PB25G_PDEC_QDI2)
#define PORT_PB25G_PDEC_QDI2                       (_UL_(1) << 25)

#define PIN_PC18G_PDEC_QDI2                        _UL_(82)    
#define MUX_PC18G_PDEC_QDI2                        _UL_(6)     
#define PINMUX_PC18G_PDEC_QDI2                     ((PIN_PC18G_PDEC_QDI2 << 16) | MUX_PC18G_PDEC_QDI2)
#define PORT_PC18G_PDEC_QDI2                       (_UL_(1) << 18)

#define PIN_PB22G_PDEC_QDI2                        _UL_(54)    
#define MUX_PB22G_PDEC_QDI2                        _UL_(6)     
#define PINMUX_PB22G_PDEC_QDI2                     ((PIN_PB22G_PDEC_QDI2 << 16) | MUX_PB22G_PDEC_QDI2)
#define PORT_PB22G_PDEC_QDI2                       (_UL_(1) << 22)

/* ========== PORT definition for QSPI peripheral ========== */
#define PIN_PB11H_QSPI_CS                          _UL_(43)    
#define MUX_PB11H_QSPI_CS                          _UL_(7)     
#define PINMUX_PB11H_QSPI_CS                       ((PIN_PB11H_QSPI_CS << 16) | MUX_PB11H_QSPI_CS)
#define PORT_PB11H_QSPI_CS                         (_UL_(1) << 11)

#define PIN_PA08H_QSPI_DATA0                       _UL_(8)     
#define MUX_PA08H_QSPI_DATA0                       _UL_(7)     
#define PINMUX_PA08H_QSPI_DATA0                    ((PIN_PA08H_QSPI_DATA0 << 16) | MUX_PA08H_QSPI_DATA0)
#define PORT_PA08H_QSPI_DATA0                      (_UL_(1) << 8)

#define PIN_PA09H_QSPI_DATA1                       _UL_(9)     
#define MUX_PA09H_QSPI_DATA1                       _UL_(7)     
#define PINMUX_PA09H_QSPI_DATA1                    ((PIN_PA09H_QSPI_DATA1 << 16) | MUX_PA09H_QSPI_DATA1)
#define PORT_PA09H_QSPI_DATA1                      (_UL_(1) << 9)

#define PIN_PA10H_QSPI_DATA2                       _UL_(10)    
#define MUX_PA10H_QSPI_DATA2                       _UL_(7)     
#define PINMUX_PA10H_QSPI_DATA2                    ((PIN_PA10H_QSPI_DATA2 << 16) | MUX_PA10H_QSPI_DATA2)
#define PORT_PA10H_QSPI_DATA2                      (_UL_(1) << 10)

#define PIN_PA11H_QSPI_DATA3                       _UL_(11)    
#define MUX_PA11H_QSPI_DATA3                       _UL_(7)     
#define PINMUX_PA11H_QSPI_DATA3                    ((PIN_PA11H_QSPI_DATA3 << 16) | MUX_PA11H_QSPI_DATA3)
#define PORT_PA11H_QSPI_DATA3                      (_UL_(1) << 11)

#define PIN_PB10H_QSPI_SCK                         _UL_(42)    
#define MUX_PB10H_QSPI_SCK                         _UL_(7)     
#define PINMUX_PB10H_QSPI_SCK                      ((PIN_PB10H_QSPI_SCK << 16) | MUX_PB10H_QSPI_SCK)
#define PORT_PB10H_QSPI_SCK                        (_UL_(1) << 10)

/* ========== PORT definition for SDHC0 peripheral ========== */
#define PIN_PA06I_SDHC0_SDCD                       _UL_(6)     
#define MUX_PA06I_SDHC0_SDCD                       _UL_(8)     
#define PINMUX_PA06I_SDHC0_SDCD                    ((PIN_PA06I_SDHC0_SDCD << 16) | MUX_PA06I_SDHC0_SDCD)
#define PORT_PA06I_SDHC0_SDCD                      (_UL_(1) << 6)

#define PIN_PA12I_SDHC0_SDCD                       _UL_(12)    
#define MUX_PA12I_SDHC0_SDCD                       _UL_(8)     
#define PINMUX_PA12I_SDHC0_SDCD                    ((PIN_PA12I_SDHC0_SDCD << 16) | MUX_PA12I_SDHC0_SDCD)
#define PORT_PA12I_SDHC0_SDCD                      (_UL_(1) << 12)

#define PIN_PB12I_SDHC0_SDCD                       _UL_(44)    
#define MUX_PB12I_SDHC0_SDCD                       _UL_(8)     
#define PINMUX_PB12I_SDHC0_SDCD                    ((PIN_PB12I_SDHC0_SDCD << 16) | MUX_PB12I_SDHC0_SDCD)
#define PORT_PB12I_SDHC0_SDCD                      (_UL_(1) << 12)

#define PIN_PC06I_SDHC0_SDCD                       _UL_(70)    
#define MUX_PC06I_SDHC0_SDCD                       _UL_(8)     
#define PINMUX_PC06I_SDHC0_SDCD                    ((PIN_PC06I_SDHC0_SDCD << 16) | MUX_PC06I_SDHC0_SDCD)
#define PORT_PC06I_SDHC0_SDCD                      (_UL_(1) << 6)

#define PIN_PB11I_SDHC0_SDCK                       _UL_(43)    
#define MUX_PB11I_SDHC0_SDCK                       _UL_(8)     
#define PINMUX_PB11I_SDHC0_SDCK                    ((PIN_PB11I_SDHC0_SDCK << 16) | MUX_PB11I_SDHC0_SDCK)
#define PORT_PB11I_SDHC0_SDCK                      (_UL_(1) << 11)

#define PIN_PA08I_SDHC0_SDCMD                      _UL_(8)     
#define MUX_PA08I_SDHC0_SDCMD                      _UL_(8)     
#define PINMUX_PA08I_SDHC0_SDCMD                   ((PIN_PA08I_SDHC0_SDCMD << 16) | MUX_PA08I_SDHC0_SDCMD)
#define PORT_PA08I_SDHC0_SDCMD                     (_UL_(1) << 8)

#define PIN_PA09I_SDHC0_SDDAT0                     _UL_(9)     
#define MUX_PA09I_SDHC0_SDDAT0                     _UL_(8)     
#define PINMUX_PA09I_SDHC0_SDDAT0                  ((PIN_PA09I_SDHC0_SDDAT0 << 16) | MUX_PA09I_SDHC0_SDDAT0)
#define PORT_PA09I_SDHC0_SDDAT0                    (_UL_(1) << 9)

#define PIN_PA10I_SDHC0_SDDAT1                     _UL_(10)    
#define MUX_PA10I_SDHC0_SDDAT1                     _UL_(8)     
#define PINMUX_PA10I_SDHC0_SDDAT1                  ((PIN_PA10I_SDHC0_SDDAT1 << 16) | MUX_PA10I_SDHC0_SDDAT1)
#define PORT_PA10I_SDHC0_SDDAT1                    (_UL_(1) << 10)

#define PIN_PA11I_SDHC0_SDDAT2                     _UL_(11)    
#define MUX_PA11I_SDHC0_SDDAT2                     _UL_(8)     
#define PINMUX_PA11I_SDHC0_SDDAT2                  ((PIN_PA11I_SDHC0_SDDAT2 << 16) | MUX_PA11I_SDHC0_SDDAT2)
#define PORT_PA11I_SDHC0_SDDAT2                    (_UL_(1) << 11)

#define PIN_PB10I_SDHC0_SDDAT3                     _UL_(42)    
#define MUX_PB10I_SDHC0_SDDAT3                     _UL_(8)     
#define PINMUX_PB10I_SDHC0_SDDAT3                  ((PIN_PB10I_SDHC0_SDDAT3 << 16) | MUX_PB10I_SDHC0_SDDAT3)
#define PORT_PB10I_SDHC0_SDDAT3                    (_UL_(1) << 10)

