Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.1/include/pio/pic32cx1025sg41100.h
#define PIN_PA07I_SDHC0_SDWP                       _UL_(7)     
#define MUX_PA07I_SDHC0_SDWP                       _UL_(8)     
#define PINMUX_PA07I_SDHC0_SDWP                    ((PIN_PA07I_SDHC0_SDWP << 16) | MUX_PA07I_SDHC0_SDWP)
#define PORT_PA07I_SDHC0_SDWP                      (_UL_(1) << 7)

#define PIN_PA13I_SDHC0_SDWP                       _UL_(13)    
#define MUX_PA13I_SDHC0_SDWP                       _UL_(8)     
#define PINMUX_PA13I_SDHC0_SDWP                    ((PIN_PA13I_SDHC0_SDWP << 16) | MUX_PA13I_SDHC0_SDWP)
#define PORT_PA13I_SDHC0_SDWP                      (_UL_(1) << 13)

#define PIN_PB13I_SDHC0_SDWP                       _UL_(45)    
#define MUX_PB13I_SDHC0_SDWP                       _UL_(8)     
#define PINMUX_PB13I_SDHC0_SDWP                    ((PIN_PB13I_SDHC0_SDWP << 16) | MUX_PB13I_SDHC0_SDWP)
#define PORT_PB13I_SDHC0_SDWP                      (_UL_(1) << 13)

#define PIN_PC07I_SDHC0_SDWP                       _UL_(71)    
#define MUX_PC07I_SDHC0_SDWP                       _UL_(8)     
#define PINMUX_PC07I_SDHC0_SDWP                    ((PIN_PC07I_SDHC0_SDWP << 16) | MUX_PC07I_SDHC0_SDWP)
#define PORT_PC07I_SDHC0_SDWP                      (_UL_(1) << 7)

/* ========== PORT definition for SDHC1 peripheral ========== */
#define PIN_PB16I_SDHC1_SDCD                       _UL_(48)    
#define MUX_PB16I_SDHC1_SDCD                       _UL_(8)     
#define PINMUX_PB16I_SDHC1_SDCD                    ((PIN_PB16I_SDHC1_SDCD << 16) | MUX_PB16I_SDHC1_SDCD)
#define PORT_PB16I_SDHC1_SDCD                      (_UL_(1) << 16)

#define PIN_PC20I_SDHC1_SDCD                       _UL_(84)    
#define MUX_PC20I_SDHC1_SDCD                       _UL_(8)     
#define PINMUX_PC20I_SDHC1_SDCD                    ((PIN_PC20I_SDHC1_SDCD << 16) | MUX_PC20I_SDHC1_SDCD)
#define PORT_PC20I_SDHC1_SDCD                      (_UL_(1) << 20)

#define PIN_PA21I_SDHC1_SDCK                       _UL_(21)    
#define MUX_PA21I_SDHC1_SDCK                       _UL_(8)     
#define PINMUX_PA21I_SDHC1_SDCK                    ((PIN_PA21I_SDHC1_SDCK << 16) | MUX_PA21I_SDHC1_SDCK)
#define PORT_PA21I_SDHC1_SDCK                      (_UL_(1) << 21)

#define PIN_PA20I_SDHC1_SDCMD                      _UL_(20)    
#define MUX_PA20I_SDHC1_SDCMD                      _UL_(8)     
#define PINMUX_PA20I_SDHC1_SDCMD                   ((PIN_PA20I_SDHC1_SDCMD << 16) | MUX_PA20I_SDHC1_SDCMD)
#define PORT_PA20I_SDHC1_SDCMD                     (_UL_(1) << 20)

#define PIN_PB18I_SDHC1_SDDAT0                     _UL_(50)    
#define MUX_PB18I_SDHC1_SDDAT0                     _UL_(8)     
#define PINMUX_PB18I_SDHC1_SDDAT0                  ((PIN_PB18I_SDHC1_SDDAT0 << 16) | MUX_PB18I_SDHC1_SDDAT0)
#define PORT_PB18I_SDHC1_SDDAT0                    (_UL_(1) << 18)

#define PIN_PB19I_SDHC1_SDDAT1                     _UL_(51)    
#define MUX_PB19I_SDHC1_SDDAT1                     _UL_(8)     
#define PINMUX_PB19I_SDHC1_SDDAT1                  ((PIN_PB19I_SDHC1_SDDAT1 << 16) | MUX_PB19I_SDHC1_SDDAT1)
#define PORT_PB19I_SDHC1_SDDAT1                    (_UL_(1) << 19)

#define PIN_PB20I_SDHC1_SDDAT2                     _UL_(52)    
#define MUX_PB20I_SDHC1_SDDAT2                     _UL_(8)     
#define PINMUX_PB20I_SDHC1_SDDAT2                  ((PIN_PB20I_SDHC1_SDDAT2 << 16) | MUX_PB20I_SDHC1_SDDAT2)
#define PORT_PB20I_SDHC1_SDDAT2                    (_UL_(1) << 20)

#define PIN_PB21I_SDHC1_SDDAT3                     _UL_(53)    
#define MUX_PB21I_SDHC1_SDDAT3                     _UL_(8)     
#define PINMUX_PB21I_SDHC1_SDDAT3                  ((PIN_PB21I_SDHC1_SDDAT3 << 16) | MUX_PB21I_SDHC1_SDDAT3)
#define PORT_PB21I_SDHC1_SDDAT3                    (_UL_(1) << 21)

#define PIN_PB17I_SDHC1_SDWP                       _UL_(49)    
#define MUX_PB17I_SDHC1_SDWP                       _UL_(8)     
#define PINMUX_PB17I_SDHC1_SDWP                    ((PIN_PB17I_SDHC1_SDWP << 16) | MUX_PB17I_SDHC1_SDWP)
#define PORT_PB17I_SDHC1_SDWP                      (_UL_(1) << 17)

#define PIN_PC21I_SDHC1_SDWP                       _UL_(85)    
#define MUX_PC21I_SDHC1_SDWP                       _UL_(8)     
#define PINMUX_PC21I_SDHC1_SDWP                    ((PIN_PC21I_SDHC1_SDWP << 16) | MUX_PC21I_SDHC1_SDWP)
#define PORT_PC21I_SDHC1_SDWP                      (_UL_(1) << 21)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA04D_SERCOM0_PAD0                     _UL_(4)     
#define MUX_PA04D_SERCOM0_PAD0                     _UL_(3)     
#define PINMUX_PA04D_SERCOM0_PAD0                  ((PIN_PA04D_SERCOM0_PAD0 << 16) | MUX_PA04D_SERCOM0_PAD0)
#define PORT_PA04D_SERCOM0_PAD0                    (_UL_(1) << 4)

#define PIN_PC17D_SERCOM0_PAD0                     _UL_(81)    
#define MUX_PC17D_SERCOM0_PAD0                     _UL_(3)     
#define PINMUX_PC17D_SERCOM0_PAD0                  ((PIN_PC17D_SERCOM0_PAD0 << 16) | MUX_PC17D_SERCOM0_PAD0)
#define PORT_PC17D_SERCOM0_PAD0                    (_UL_(1) << 17)

#define PIN_PA08C_SERCOM0_PAD0                     _UL_(8)     
#define MUX_PA08C_SERCOM0_PAD0                     _UL_(2)     
#define PINMUX_PA08C_SERCOM0_PAD0                  ((PIN_PA08C_SERCOM0_PAD0 << 16) | MUX_PA08C_SERCOM0_PAD0)
#define PORT_PA08C_SERCOM0_PAD0                    (_UL_(1) << 8)

#define PIN_PB24C_SERCOM0_PAD0                     _UL_(56)    
#define MUX_PB24C_SERCOM0_PAD0                     _UL_(2)     
#define PINMUX_PB24C_SERCOM0_PAD0                  ((PIN_PB24C_SERCOM0_PAD0 << 16) | MUX_PB24C_SERCOM0_PAD0)
#define PORT_PB24C_SERCOM0_PAD0                    (_UL_(1) << 24)

#define PIN_PA05D_SERCOM0_PAD1                     _UL_(5)     
#define MUX_PA05D_SERCOM0_PAD1                     _UL_(3)     
#define PINMUX_PA05D_SERCOM0_PAD1                  ((PIN_PA05D_SERCOM0_PAD1 << 16) | MUX_PA05D_SERCOM0_PAD1)
#define PORT_PA05D_SERCOM0_PAD1                    (_UL_(1) << 5)

#define PIN_PC16D_SERCOM0_PAD1                     _UL_(80)    
#define MUX_PC16D_SERCOM0_PAD1                     _UL_(3)     
#define PINMUX_PC16D_SERCOM0_PAD1                  ((PIN_PC16D_SERCOM0_PAD1 << 16) | MUX_PC16D_SERCOM0_PAD1)
#define PORT_PC16D_SERCOM0_PAD1                    (_UL_(1) << 16)

#define PIN_PA09C_SERCOM0_PAD1                     _UL_(9)     
#define MUX_PA09C_SERCOM0_PAD1                     _UL_(2)     
#define PINMUX_PA09C_SERCOM0_PAD1                  ((PIN_PA09C_SERCOM0_PAD1 << 16) | MUX_PA09C_SERCOM0_PAD1)
#define PORT_PA09C_SERCOM0_PAD1                    (_UL_(1) << 9)

#define PIN_PB25C_SERCOM0_PAD1                     _UL_(57)    
#define MUX_PB25C_SERCOM0_PAD1                     _UL_(2)     
#define PINMUX_PB25C_SERCOM0_PAD1                  ((PIN_PB25C_SERCOM0_PAD1 << 16) | MUX_PB25C_SERCOM0_PAD1)
#define PORT_PB25C_SERCOM0_PAD1                    (_UL_(1) << 25)

#define PIN_PA06D_SERCOM0_PAD2                     _UL_(6)     
#define MUX_PA06D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PA06D_SERCOM0_PAD2                  ((PIN_PA06D_SERCOM0_PAD2 << 16) | MUX_PA06D_SERCOM0_PAD2)
#define PORT_PA06D_SERCOM0_PAD2                    (_UL_(1) << 6)

#define PIN_PC18D_SERCOM0_PAD2                     _UL_(82)    
#define MUX_PC18D_SERCOM0_PAD2                     _UL_(3)     
#define PINMUX_PC18D_SERCOM0_PAD2                  ((PIN_PC18D_SERCOM0_PAD2 << 16) | MUX_PC18D_SERCOM0_PAD2)
#define PORT_PC18D_SERCOM0_PAD2                    (_UL_(1) << 18)

#define PIN_PA10C_SERCOM0_PAD2                     _UL_(10)    
#define MUX_PA10C_SERCOM0_PAD2                     _UL_(2)     
#define PINMUX_PA10C_SERCOM0_PAD2                  ((PIN_PA10C_SERCOM0_PAD2 << 16) | MUX_PA10C_SERCOM0_PAD2)
#define PORT_PA10C_SERCOM0_PAD2                    (_UL_(1) << 10)

#define PIN_PC24C_SERCOM0_PAD2                     _UL_(88)    
#define MUX_PC24C_SERCOM0_PAD2                     _UL_(2)     
#define PINMUX_PC24C_SERCOM0_PAD2                  ((PIN_PC24C_SERCOM0_PAD2 << 16) | MUX_PC24C_SERCOM0_PAD2)
#define PORT_PC24C_SERCOM0_PAD2                    (_UL_(1) << 24)

#define PIN_PA07D_SERCOM0_PAD3                     _UL_(7)     
#define MUX_PA07D_SERCOM0_PAD3                     _UL_(3)     
#define PINMUX_PA07D_SERCOM0_PAD3                  ((PIN_PA07D_SERCOM0_PAD3 << 16) | MUX_PA07D_SERCOM0_PAD3)
#define PORT_PA07D_SERCOM0_PAD3                    (_UL_(1) << 7)

#define PIN_PC19D_SERCOM0_PAD3                     _UL_(83)    
#define MUX_PC19D_SERCOM0_PAD3                     _UL_(3)     
#define PINMUX_PC19D_SERCOM0_PAD3                  ((PIN_PC19D_SERCOM0_PAD3 << 16) | MUX_PC19D_SERCOM0_PAD3)
#define PORT_PC19D_SERCOM0_PAD3                    (_UL_(1) << 19)

